app/controllers/contas_a_pagars_controller.rb

SELECT "contas_a_pagars".* FROM "contas_a_pagars"
---
  def index
    @contas_a_pagars = ContasAPagar.all

SELECT  "contas_a_pagars".* FROM "contas_a_pagars" WHERE "contas_a_pagars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_contas_a_pagar
      @contas_a_pagar = ContasAPagar.find(params[:id])