app/controllers/equipes_controller.rb

SELECT  "equipes".* FROM "equipes" WHERE "equipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_equipe
      @equipe = Equipe.find(params[:id])