app/controllers/tios_controller.rb

  def index
    @tios = Tio.all
---
SELECT "tios".* FROM "tios"

    def set_tio
      @tio = Tio.find(params[:id])
---
SELECT  "tios".* FROM "tios" WHERE "tios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]